### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.argocd-application.kubectl_manifest.application will be updated in-place
!   resource "kubectl_manifest" "application" {
        id                      = "/apis/argoproj.io/v1alpha1/namespaces/argo-cd/applications/cluster"
        name                    = "cluster"
!       yaml_body               = (sensitive value)
        # (16 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_eks_access_entry.this["cluster_creator"] must be replaced
-/+ resource "aws_eks_access_entry" "this" {
!       access_entry_arn  = "arn:aws:eks:us-west-2:942910146681:access-entry/manifold/user/942910146681/automation/08c7c606-a26a-6816-465f-2dac4896ad44" -> (known after apply)
!       created_at        = "2024-05-18T14:13:51Z" -> (known after apply)
!       id                = "manifold:arn:aws:iam::942910146681:user/automation" -> (known after apply)
!       kubernetes_groups = [] -> (known after apply)
!       modified_at       = "2024-05-18T14:13:51Z" -> (known after apply)
!       principal_arn     = "arn:aws:iam::942910146681:user/automation" -> "arn:aws:iam::942910146681:role/cicd" # forces replacement
-       tags              = {} -> null
!       tags_all          = {} -> (known after apply)
!       user_name         = "arn:aws:iam::942910146681:user/automation" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] must be replaced
-/+ resource "aws_eks_access_policy_association" "this" {
!       associated_at = "2024-05-18 14:13:51.779 +0000 UTC" -> (known after apply)
!       id            = "manifold#arn:aws:iam::942910146681:user/automation#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy" -> (known after apply)
!       modified_at   = "2024-05-18 14:13:51.779 +0000 UTC" -> (known after apply)
!       principal_arn = "arn:aws:iam::942910146681:user/automation" -> "arn:aws:iam::942910146681:role/cicd" # forces replacement
        # (2 unchanged attributes hidden)

!       access_scope {
-           namespaces = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks.module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
!   resource "aws_kms_key" "this" {
        id                                 = "7d687347-8f7d-4434-a192-dced9f32812e"
!       policy                             = jsonencode(
!           {
!               Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::942910146681:root"
                        }
                        Resource  = "*"
                        Sid       = "Default"
                    },
!                   {
!                       Principal = {
!                           AWS = "arn:aws:iam::942910146681:user/automation" -> "arn:aws:iam::942910146681:role/cicd"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::942910146681:role/manifold-cluster-20240518140403074500000002"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "terraform-aws-modules" = "eks"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```
</details>